Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo
An interface for a specific model version information in the cloud.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo.ModelInfo
Gets the model information associated with the version.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo.VersionId
Model Version cloud identifier

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo.VersionSchemaVersion
Gets the schema version of a version.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo.VersionCreatedAt
Gets the creation timestamp of the version.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo.VersionUpdatedAt
Gets the timestamp on the last update of the version.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo.VersionCreatedBy
Gets the display name of the user who created the version.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo.VersionDescription
Gets the description or comment on the version

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo.VersionUpdatedBy
Gets the display name of the user who last updated the version.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo.FriendlyVersion
Gets the revision name of the version

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo.VersionAuthor
Gets the version's author metadata.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo.Branch
Gets the version's branch state, which can be "main", "detached", or other states depending on the cloud service's branching
model.
State can be null when the server did not provide this information, for example when the version is pending upload and not
finalized, or when the cloud service does not support branching.
Remarks:
Main: Part of the mainline version history (reachable from current version)
Detached: Not reachable from current version
Undefined: Version is pending upload (not yet finalized) or being processed, or the cloud service does not provide branching
information.
The mainline of a model history would look as below.
HEAD (current version in the mainline)
|
v1 --> v2 --> v3 --> v4 --> v5
A version MUST be in the mainline to receive diff calculation support.
A model history with detached versions would look as below.
Here the user rolled back from v5 to a previous v2 version.
This causes v3,v4 and v5 to be detached from the mainline.
They will not be reachable from the current version (HEAD) anymore.
Since it is only possible to walk "backwards" from the HEAD.
v1 --> v2 (current version)
\
`-> v3 --> v4 –-> v5 (versions 3, 4, 5 are now detached)
Being detached versions, v3, v4 and v5 will NOT receive diff calculation support.